---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadCombination.State
source: html/33a55c46-e223-f4e7-c56d-72391f4e607d.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.State Property

The state of the load combination.

## Syntax (C#)
```csharp
public LoadCombinationState State { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration